import xml.etree.ElementTree as ET

xml_data = ['안녕하세요. 로시컴-네이버 지식iN 상담변호사 우종환 입니다. ​지방노동위원회에 부당해고 구제신청 하시고 노동청에는 주휴수당 체불임금진정을 해보시기 바랍니다.​그리고 cctv는 업무상 필요에 의해 설치 할 수도 있으니 처벌은 어려워 보입니다.','안녕하세요. 로시컴-네이버 지식iN 상담변호사 우종환 입니다. ​근로계약서 미작성은 노동청에 신고(진정)하시는 것입니다. 진정하신 노동청을 방문하셔서 물어보시고 서류 작성하시기 바랍니다.',
"안녕하세요. 로톡-네이버 지식iN 상담변호사 김호제 입니다.​근로와 관련된 사건 사고는 산업재해로 사람이 업무레 관계되는 작업 혹은그 밖의 업무로 인하여 부상을 당했다면 시청할수 있으며, 사측에서 치료등을 거부하거나 미온적으로 대응한다면 고용노동부를 통해서중재를 받을수 있습니다.​더 자세한 민사 형사 법률상담(무료상담)이 필요한 경우 아래 '네임카드'형사변호사 상세한 상담이 필요한 경우 연락처: 010-2737-8520연락처의 전화상담 & 카톡 으로 문의하시면 성심껏 답변 드립니다."
,"안녕하세요. 서울지방변호사회 소속으로 지식iN 법률상담을 진행하고 있는 주선민 변호사입니다.​가정폭력으로 인한 이혼에서 가정폭력의 증거로써 가족구성원들의 증언은 유효합니다. 가정폭력은 배우자 또는 배우자와의 친족 간의 폭행, 협박, 감금, 학대 등으로서, 혼인관계를 파탄에 이르게 할 정도의 중한 행위입니다. 가족구성원들의 증언은 가정폭력이 있었음을 직접적으로 증명하는 것은 아니지만, 가정폭력의 발생을 추정할 수 있는 중요한 증거가 될 수 있습니다.​아버지쪽이 집안에 빚이 많음에도 불구하고 구직활동 및 노동을 전혀 안하고 있는 부분은 이혼사유가 될 수 있습니다. 민법 제840조 제6호는 \"배우자가 직업능력이 없거나 재산이 없고, 다른 직업을 얻을 수 없는 경우로서 혼인생활을 계속하기 어려운 사유가 있는 때\"를 이혼사유로 규정하고 있습니다. 이 경우, 아버지쪽의 의무 불이행이 혼인생활을 계속하기 어려운 사유로 인정될 수 있습니다.​건강보험료 미납에 대한 의무는 가입자와 피부양자 사이에서 발생합니다. 따라서, 귀하께서 건강보험료 미납에 대한 의무가 있는 것은 아닙니다. 귀하께서 건강보험료 미납에 대한 의무가 있다고 하더라도, 아버지쪽이 귀하께 미납된 건강보험료를 갚을 것을 청구할 수 있습니다.​현재 어려움을 겪고 계시다면 저희와 함께해 보세요, 우리는 질문자님과 함께할 준비가 되어 있습니다,​​https://cafe.naver.com/w3mj​","안녕하세요. 네이버 법률과 함께 지식iN 법률상담을 진행하고 있는 송명호 변호사입니다.                                                                                                                                                                                                                                                                                                     우선 결론부터 말씀드리면, 1)   어머니께서 재혼을 하면 친할아버지와의 법적 관계는 모두 소멸합니다. 질문자님 말씀처럼 남입니다.2)   다만, 질문자님과 돌아가신 아버지, 친할아버지와의 친족관계는 변함없이 유지됩니다. 3)   질문자님을 위해 기도합니다.4)   변호사를 선임하지 않으셔도 변호사와 충분한 상담을 받을 수 있습니다. 변호사 선임 여부는, 변호사와 상담을 한 후 결정하시면 됩니다. 부담 갖지 마시고, “네이버 예약”을 통해 방문 상담을 신청해주세요.5)   이혼 및 상속 사건은, 어렵지는 않지만, 일반 민사 사건과 다른 독특한 특징(ex. 사전처분, 가사조사, 조정전치주의 등)이 많기 때문에, 전문변호사의 검토를 받으셔야 안전합니다.                                                                                                                                                                                                                                                                                                                             - ‘변호사를 꼭 선임해야 하는지’에 관한 이런저런 고민들… 상담 요청 중 가장 많은 질문이, ‘변호사를 선임해야 하는지’에 관한 것입니다. 왜냐하면, 가장 경제적으로 부담이 되는 부분이기 때문입니다. 본인 소송이 원칙이고, 변호사 선임은 어디까지나 선택사항입니다. 따라서 증거 관계가 분명하거나 절차상 문제가 없을 것으로 예상된다면, 본인이 직접 소송을 진행하는 것이 좋습니다. 다만, 증거나 절차상 어려움이 있거나, 매번 법정에 출두하기 어려운 상황이라면, 변호사를 선임하는 것이 좋습니다.  - 어떤 변호사를 선임해야 하나요? 의뢰인이 가장 고민하는 문제는, 아마도 어떤 변호사를 선임해야 하는지에 대한 것입니다. 이에 대해서는 여러가지 기준이 있겠지만, 제 생각을 말씀드리면, 인생에서 소송을 해야 하는 경우가 많아야 `1 ~ 3번정도이라는 점을 고려하면, 가능하면 마음에 드는 변호사(말이 잘 통하는 변호사, 호감이 가는 변호사. 신뢰할 수 있는 변호사 등)를 선임하시는 것이 좋을 것 같습니다. 실제로 소송을 6개월 ~ 12개월 정도 진행되는데, 그 기간동안 의뢰인과 변호사는 한 팀이 됩니다. 같은 팀이 될 사람이라면, 당연히 좋아하거나, 신뢰할 수 있는 사람이어야 할 것 같습니다. 저 역시도 이제는, 수임료 많이 주는 의뢰인보다는, 제가 좋아할 수 있는 의뢰인의 사건을 진행하고 싶은 마음이 듭니다. 변호사인 제가 그러할진대, 의뢰인분도 그렇지 않을까 싶습니다.  이혼전문변호사 또는 상속전문변호사를 찾으신다면, 전문 변호사 등록번호(대한변호사협회에서 직접 관리, 인정하는 번호입니다)를 꼭 확인하시기 바랍니다.",

"안녕하세요. 로시컴과 함께 지식iN 법률상담을 진행하고 있는 정진 변호사 입니다.​숙려기간 전에는 어려울 듯합니다.​이혼이 안 되는 경우도 있기 때문입니다.​혼자서 이혼소송 진행이 어려우면 변호사 선임을 고려해야 합니다.​이혼사유의 구성 및 입증방법의 강구를 위해 직접 변호사와 구체적인 상담을 해보는 게 좋습니다.​변호사 선임 시 변호사의 경력 및 주된 업무분야를 반드시 확인해야 합니다.​모쪼록 원만한 해결이 되기 바랍니다.",

"안녕하세요사랑과전쟁 카페에서 활동 중인 김선호 변호사입니다.​귀하의 경우, 상대방의 배우자가 문자와 통화 내용을 근거로 귀하를 상대로 상간남소송을 제기하려고 합니다. 그러나 귀하가 밝힌 바와 같이 상대방의 배우자와 부정한 관계를 맺었다는 사실이 없다면, 귀하가 상간남소송 방어에서 승소할 가능성이 높습니다.​귀하가 상간남소송에서 승소하기 위해서는 다음과 같은 방법을 고려해 볼 수 있습니다.상대방의 배우자가 귀하와 부정한 관계를 맺었다는 사실을 증명할 수 없다는 점을 주장합니다.​상대방의 배우자가 귀하에게 위자료를 청구하는 것은 부당하다는 점을 주장합니다.​귀하가 상간남소송을 진행하기 위해서는 변호사의 조력을 받는 것이 좋습니다. 변호사는 귀하의 입장을 대변하고, 귀하의 권리를 보호하기 위해 최선을 다할 것입니다.​소송 시 귀하의 입장을 분명하게 밝히고, 증거자료를 제출해야 합니다.소송이 진행되는 동안 변호사의 조력을 받아, 귀하의 권리를 보호해야 합니다.귀하의 억울함이 풀리기를 바랍니다.​소송에서 승소하게 되면 상대방에게 비용을 청구할 수 있습니다.​현재 어려움을 겪고 계시다면 저희와 함께해 보세요, 우리는 질문자님과 함께할 준비가 되어 있습니다​​https://cafe.naver.com/w3mj                                                                                                                                                                                                                                                                                                                                                                                                사랑과전쟁 카페 - 이혼, 상간녀 ... : 네이버 카페                                        이혼전문, 상간소전문, 가사법 전문 변호사                                        cafe.naver.com                                                                                                                                                                                                                                                                                                            ​","안녕하세요. 대한변호사협회등록 이혼전문변호사 이성호입니다.​​이혼재산분할 때 최대한의 결과를 얻기 위해서 중점적으로 봐야할 부분은 특유재산과 재산 형성에 대한 기여도입니다. 이 기여도는 부부가 혼인 중에 함께 축적한 재산을 나누는 기준이라고 보시면 되는데요. 가령 한쪽이 더 많은 기여를 했다면 그 사람의 비율이 높아질 수 있습니다. 그러나 혼인의 기간이나 다른 요소들도 함께 평가되기 때문에 단순히 어떤 사안만을 가지고 기여도를 예단하는 것은 조심해야 합니다.​특유재산은 이혼재산분할에서 중요한 부분을 차지합니다. 이것은 부부가 공동으로 모은 재산 이외에 배우자가 개별로 소유하던 재산을 지칭합니다. 예컨대, 결혼 전에 갖게 된 재산이나 증여 혹은 상속으로 얻은 재산입니다. 특유재산은 원칙적으로 분할 항목에서 제외되지만, 실제 소송에서는 종종 분할에 포함되곤 합니다. 그래서 상대방의 특유재산중 어느 정도까지 분할의 대상이 될 수 있는지 확인하는 것이 필요합니다.​이런 다양한 요소들 때문에 이혼재산분할 시에는 전문가의 조언이 필요합니다. 전문 변호사와 상담을 통해 이혼재산분할에 대한 더 나은 방향을 모색할 수 있습니다.​이혼재산분할 관련하여 여러분 상황에 필요한 맞춤 법률 상담을 원하시는 분은 카카오톡 상담이나 네임카드 전화번호로 문의하시면 됩니다.​카카오톡 상담 :                                                                                                                                                                                                                                                                                                                                                                                                 법무법인 감명 이혼 전담센터                                        이혼·가사전문변호사를 중심으로 결성된 법무법인감명의 이혼 전담센터입니다. 24시간 전화상담가능                                        pf.kakao.com                                                                                                                                                                                                                                                                                                            ​이혼소송 피고 관련한 자세한 내용은 아래 블로그에서 확인해 보세요.​                                                                                                                                                                                                                                                                                                                                                                                                이혼 재산분할의 모든 것 : 재산분할의 해법                                        결혼을 하게 되면 부부가 공동으로 재산을 축적하며 함께 그 이익을 공유하게 됩니다. 둘이서 하나의 가계...                                        blog.naver.com                                                                                                                                                                                                                                                                                                            ​​법무법인 감명의 성공사례를 보고 싶다면?​                                                                                                                                                                                                                                                                                            이혼전문 / 상간녀소송 · 상간남소송 특화 | 법무법인 감명                                        법무법인감명, 이혼전문, 상간녀소송 · 상간남소송 특화, 여성의 이혼, 남성의 이혼,황혼이혼                                        divorce.gammyung.com                                                                                                                                                                                                                                                                                                            ​"
,

"​귀하가 말씀하신 내용이 모두 가능합니다. 협의이혼은 당사자 쌍방이 이혼에 동의하고, 이혼에 따른 사항에 대해 합의한 경우, 법원에 이혼신청을 하면, 법원이 이를 그대로 받아들이는 방식으로 진행됩니다.​따라서, 귀하와 남편이 친권, 양육권, 재산분할, 위자료, 양육비 지급에 대해 모두 합의한 경우, 협의이혼이 가능합니다.​구체적으로, 협의이혼을 위해서는 다음과 같은 서류가 필요합니다.​이혼신청서이혼합의서양육비 부담조서친권자 지정서혼인관계증명서주민등록등본주민등록초본​이혼신청서와 이혼합의서는 법원에서 구입하거나 인터넷에서 다운로드할 수 있습니다. 양육비 부담조서는 양육비를 지급할 의무가 있는 자가 양육비를 지급하는 방법, 시기, 금액 등을 기재한 문서입니다. 친권자 지정서는 양육권과 함께 결정되는 사항으로, 친권을 행사할 자를 지정하는 문서입니다. 혼인관계증명서, 주민등록등본, 주민등록초본, 출생증명서는 당사자의 신분을 확인하기 위한 서류입니다.​이혼신청서와 이혼합의서에는 귀하와 남편의 상호 인적사항, 혼인기간, 이혼사유, 재산분할, 위자료, 양육비 지급 등에 대한 내용이 기재되어야 합니다. 양육비 부담조서에는 양육비를 지급할 의무가 있는 자의 인적사항, 양육비를 지급받는 자의 인적사항, 양육비를 지급하는 방법, 시기, 금액 등이 기재되어야 합니다. 친권자 지정서에는 친권을 행사할 자의 인적사항이 기재되어야 합니다.​이혼신청서와 이혼합의서, 양육비 부담조서, 친권자 지정서를 작성한 후, 해당 서류를 첨부하여 관할 가정법원에 이혼신청을 하면 됩니다. 이혼신청은 당사자 쌍방이 직접 출석하여 신청하거나, 대리인을 통해 신청할 수 있습니다.​이혼신청을 하면, 법원은 귀하와 남편을 소환하여 이혼에 대한 의사를 확인합니다. 또한, 양육비 지급에 대해서는 양육비 부담조서에 기재된 내용을 확인합니다.​귀하와 남편이 이혼에 대한 의사를 확인하고, 양육비 부담조서에 기재된 내용이 적절하다고 판단되는 경우, 법원은 이혼을 허가하는 결정을 합니다. 이혼 결정이 확정되면, 귀하와 남편은 합의한 내용에 따라 이혼하게 됩니다.​귀하의 경우, 재산분할, 위자료, 양육비 지급에 대해서는 서로 협의가 된 것으로 보이므로, 이혼신청서와 이혼합의서, 양육비 부담조서만 준비하시면 됩니다. 또한, 귀하가 경제활동을 하고 있다면, 양육비 지급에 대한 의무는 없으므로, 양육비 부담조서에 귀하의 이름을 기재하지 않아도 됩니다. 현재 어려움을 겪고 계시다면 저희와 함께해 보세요, 우리는 질문자님과 함께할 준비가 되어 있습니다​https://cafe.naver.com/w3mj사랑과전쟁 카페 - 이혼, 상간녀 ... : 네이버 카페이혼전문, 상간소전문, 가사법 전문 변호사cafe.naver.com​",

"안녕하세요. 로톡-네이버 지식iN 상담변호사 김호제 입니다.​근로와 관련된 사건 사고는 산업재해로 사람이 업무레 관계되는 작업 혹은그 밖의 업무로 인하여 부상을 당했다면 시청할수 있으며, 사측에서 치료등을 거부하거나 미온적으로 대응한다면 고용노동부를 통해서중재를 받을수 있습니다.​더 자세한 민사 형사 법률상담(무료상담)이 필요한 경우 아래 '네임카드'형사변호사 상세한 상담이 필요한 경우 연락처: 010-2737-8520연락처의 전화상담 & 카톡 으로 문의하시면 성심껏 답변 드립니다.",

"안녕하세요. 로톡-네이버 지식iN 상담변호사 김호제 입니다.​반성문을 자필로 작성하여 해당되는 검사실로 우편을 통해서제출하셔도 되며, 직접 검찰 민원실을 통해서 접수하기도 합니다.​더 자세한 민사 형사 법률상담(무료상담)이 필요한 경우 아래 '네임카드'형사변호사 상세한 상담이 필요한 경우 연락처: 010-2737-8520연락처의 전화상담 & 카톡 으로 문의하시면 성심껏 답변 드립니다."
]

data = {
    "abc" : {
        "instruction": "질문",
        "output" : "대답",
        "url": "https"
    },
    "bbc" : {
        "instruction": "질문1",
        "output" : "대답1",
        "url": "https1"
    },
    "ccc" : {
        "instruction": "질문2",
        "output" : "대답2",
        "url": "https2"
    },
    "ddd" : {
        "instruction": "질문3",
        "output" : "대답3",
        "url": "https3"
    },
}

result = []

import re
import json

def clearing(printing):
    printing = re.sub('^(안녕하세요).*?(입니다\.)' , '', printing)
    printing = re.sub("\\u200b", "", printing)
    printing = re.sub("(카카오톡 상담).*", "", printing)
    printing = re.sub("(현재 어려움을 겪고).*", '', printing)
    printing = re.sub("(더 자세한).*", "", printing)
    printing = re.sub("(아무쪼록).*", "", printing)
    printing = re.sub("(사법고시 출식).*?(입니다.)", "", printing)
    printing = re.sub("(네이버 지식인 엑스퍼트에서).*", "", printing)
    printing = re.sub("우선 결론부터 말씀드리면.", "", printing)
    printing = re.sub("(질문자님을 위해 기도합니다.).*", "", printing)

    return printing

with open('./naver_kin_data_노동법_전처리.json', 'r') as f:
    json_data = json.load(f)
    print(json_data)

# for data in json_data:
#     # result = clearing(data)
#     break

# with open("./result.json", 'w', encoding='utf-8') as file:
#     json.dump(data, file, indent='\t')